name: "ResNet-50"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.0078125
    mirror: false
    crop_size: 224
    mean_value: 104.0
    mean_value: 117.0
    mean_value: 123.0
    random_resize_param {
      min_size: 256
      max_size: 256
      resize_param {
        interp_mode: CUBIC
      }
    }
  }
  data_param {
    source: "examples/imagenet/ilsvrc12_val_lmdb"
    batch_size: 1 
    backend: LMDB
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "msra"
      variance_norm: FAN_OUT
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "bn_conv1"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale_conv1"
  type: "Scale"
  bottom: "conv1"
  top: "conv1"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv1_relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
  relu_param {
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "res2a_branch1"
  type: "Convolution"
  bottom: "pool1"
  top: "res2a_branch1"
  convolution_param {
    num_output: 224
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 8.51000022888
    scale_out: 7.53000020981
    scale_params: 17655.9902344
    scale_params: 384.359985352
    scale_params: 322.010009766
    scale_params: 145172640.0
    scale_params: 5446.06982422
    scale_params: 11392.1503906
    scale_params: 597.369995117
    scale_params: 23063.1503906
    scale_params: 342.5
    scale_params: 387.679992676
    scale_params: 524.659973145
    scale_params: 361.130004883
    scale_params: 13295.6699219
    scale_params: 577.510009766
    scale_params: 1567.82995605
    scale_params: 1175.38000488
    scale_params: 446.670013428
    scale_params: 944.030029297
    scale_params: 1189.69995117
    scale_params: 96360.1796875
    scale_params: 273.899993896
    scale_params: 255.199996948
    scale_params: 376.089996338
    scale_params: 114.36000061
    scale_params: 290031136.0
    scale_params: 163.309997559
    scale_params: 350861.125
    scale_params: 309.010009766
    scale_params: 455.220001221
    scale_params: 74.2799987793
    scale_params: 396.820007324
    scale_params: 948651.5625
    scale_params: 456.609985352
    scale_params: 149321808.0
    scale_params: 900.729980469
    scale_params: 386.920013428
    scale_params: 640.190002441
    scale_params: 587.020019531
    scale_params: 991.039978027
    scale_params: 456.790008545
    scale_params: 141.710006714
    scale_params: 2375.51000977
    scale_params: 483426.0
    scale_params: 718.070007324
    scale_params: 651.5
    scale_params: 64648.8007812
    scale_params: 12605.8203125
    scale_params: 228.070007324
    scale_params: 204.559997559
    scale_params: 428.940002441
    scale_params: 286.329986572
    scale_params: 219.679992676
    scale_params: 267.790008545
    scale_params: 475.519989014
    scale_params: 152.990005493
    scale_params: 683.140014648
    scale_params: 86.0899963379
    scale_params: 591.780029297
    scale_params: 112.739997864
    scale_params: 428.429992676
    scale_params: 753.08001709
    scale_params: 1469.79003906
    scale_params: 232.440002441
    scale_params: 402.369995117
    scale_params: 383.380004883
    scale_params: 275.579986572
    scale_params: 84169.34375
    scale_params: 288.170013428
    scale_params: 238.910003662
    scale_params: 1460.57995605
    scale_params: 55571.28125
    scale_params: 617.770019531
    scale_params: 175.0
    scale_params: 591.549987793
    scale_params: 348.459991455
    scale_params: 5723.58984375
    scale_params: 302.940002441
    scale_params: 1166.45996094
    scale_params: 1285.91003418
    scale_params: 102564.398438
    scale_params: 570.809997559
    scale_params: 3173.70996094
    scale_params: 1348.30004883
    scale_params: 293.049987793
    scale_params: 343.200012207
    scale_params: 341.869995117
    scale_params: 196.660003662
    scale_params: 5444.89990234
    scale_params: 361.390014648
    scale_params: 180.830001831
    scale_params: 376.630004883
    scale_params: 3536.69995117
    scale_params: 240.520004272
    scale_params: 486.420013428
    scale_params: 60.0900001526
    scale_params: 303.429992676
    scale_params: 412.0
    scale_params: 264.339996338
    scale_params: 618.799987793
    scale_params: 245.940002441
    scale_params: 448.410003662
    scale_params: 154.149993896
    scale_params: 172.789993286
    scale_params: 118.11000061
    scale_params: 934.340026855
    scale_params: 274.299987793
    scale_params: 1507.66003418
    scale_params: 311.010009766
    scale_params: 1024.18994141
    scale_params: 716.520019531
    scale_params: 196.529998779
    scale_params: 446.470001221
    scale_params: 154.580001831
    scale_params: 764.770019531
    scale_params: 301.049987793
    scale_params: 4710.95996094
    scale_params: 955.820007324
    scale_params: 414.559997559
    scale_params: 434.970001221
    scale_params: 543.33001709
    scale_params: 358.459991455
    scale_params: 20358.4902344
    scale_params: 3092064.25
    scale_params: 360.290008545
    scale_params: 247.649993896
    scale_params: 477.350006104
    scale_params: 685.700012207
    scale_params: 1238.58996582
    scale_params: 2326.48999023
    scale_params: 516.429992676
    scale_params: 1614.86999512
    scale_params: 1277.5
    scale_params: 812053.0625
    scale_params: 413.989990234
    scale_params: 704.640014648
    scale_params: 381.209991455
    scale_params: 470.089996338
    scale_params: 687.83001709
    scale_params: 349.679992676
    scale_params: 283.309997559
    scale_params: 117.550003052
    scale_params: 342.510009766
    scale_params: 15416.6201172
    scale_params: 672.229980469
    scale_params: 477.809997559
    scale_params: 288.570007324
    scale_params: 365.640014648
    scale_params: 435.239990234
    scale_params: 885.039978027
    scale_params: 293983.75
    scale_params: 488.029998779
    scale_params: 468.100006104
    scale_params: 440.989990234
    scale_params: 444.320007324
    scale_params: 2881.56005859
    scale_params: 572.41998291
    scale_params: 723.070007324
    scale_params: 277.920013428
    scale_params: 213.0
    scale_params: 569.650024414
    scale_params: 127.38999939
    scale_params: 216.679992676
    scale_params: 273.779998779
    scale_params: 120.38999939
    scale_params: 403.070007324
    scale_params: 63.4900016785
    scale_params: 501005600.0
    scale_params: 57371272.0
    scale_params: 411.200012207
    scale_params: 1455.38000488
    scale_params: 595.090026855
    scale_params: 445.230010986
    scale_params: 648.0
    scale_params: 462.950012207
    scale_params: 203.050003052
    scale_params: 1974.65002441
    scale_params: 6928255.0
    scale_params: 213.740005493
    scale_params: 384.25
    scale_params: 585.039978027
    scale_params: 238.520004272
    scale_params: 1782.94995117
    scale_params: 275.779998779
    scale_params: 266.309997559
    scale_params: 191.630004883
    scale_params: 332.959991455
    scale_params: 3082.93994141
    scale_params: 1202.7800293
    scale_params: 483.940002441
    scale_params: 163.130004883
    scale_params: 445.470001221
    scale_params: 128.869995117
    scale_params: 296.679992676
    scale_params: 10176.3095703
    scale_params: 915.789978027
    scale_params: 243.86000061
    scale_params: 415.670013428
    scale_params: 378.510009766
    scale_params: 391.309997559
    scale_params: 480.260009766
    scale_params: 141515.75
    scale_params: 159.869995117
    scale_params: 378.649993896
    scale_params: 215.559997559
    scale_params: 358.059997559
    scale_params: 8933.51953125
    scale_params: 357.019989014
    scale_params: 361.890014648
    scale_params: 289.160003662
    scale_params: 115.680000305
    scale_params: 756.960021973
    scale_params: 1182.44995117
    scale_params: 322.230010986
    scale_params: 415.549987793
    scale_params: 403.079986572
    scale_params: 2727.23999023
    scale_params: 1012.04998779
    scale_params: 362.119995117
    scale_params: 751.869995117
    scale_params: 509.320007324
    scale_params: 1184.54003906
    scale_params: 372.359985352
    scale_params: 399.510009766
    scale_params: 290.859985352
  }
}
layer {
  name: "bn2a_branch1"
  type: "BatchNorm"
  bottom: "res2a_branch1"
  top: "res2a_branch1"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2a_branch1"
  type: "Scale"
  bottom: "res2a_branch1"
  top: "res2a_branch1"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2a"
  type: "Convolution"
  bottom: "pool1"
  top: "res2a_branch2a"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 8.51000022888
    scale_out: 27.2299995422
    scale_params: 425.980010986
    scale_params: 838.770019531
    scale_params: 3024469760.0
    scale_params: 1090.94995117
    scale_params: 337.640014648
    scale_params: 302.010009766
    scale_params: 381.850006104
    scale_params: 753.059997559
    scale_params: 341.880004883
    scale_params: 354.670013428
    scale_params: 199.36000061
    scale_params: 317.480010986
    scale_params: 354.540008545
    scale_params: 615.010009766
    scale_params: 264.730010986
    scale_params: 482.940002441
    scale_params: 1591.68005371
    scale_params: 332.779998779
    scale_params: 228.350006104
    scale_params: 262.809997559
    scale_params: 296.619995117
    scale_params: 707.390014648
    scale_params: 1790121088.0
    scale_params: 318.609985352
    scale_params: 236.369995117
    scale_params: 1089.27001953
    scale_params: 2171880704.0
    scale_params: 305.869995117
    scale_params: 538.020019531
    scale_params: 351.279998779
    scale_params: 355.559997559
    scale_params: 928.890014648
    scale_params: 558.719970703
    scale_params: 330.260009766
    scale_params: 1023.72998047
    scale_params: 664.229980469
    scale_params: 567.349975586
    scale_params: 478.089996338
    scale_params: 408.619995117
    scale_params: 402.049987793
    scale_params: 758.369995117
    scale_params: 1036.72998047
    scale_params: 409.829986572
    scale_params: 498.519989014
    scale_params: 355.75
    scale_params: 210.630004883
    scale_params: 1029.82995605
    scale_params: 456.559997559
    scale_params: 317.279998779
    scale_params: 587.210021973
    scale_params: 643.200012207
    scale_params: 351.010009766
    scale_params: 947.119995117
    scale_params: 459.459991455
    scale_params: 433.200012207
    scale_params: 288.440002441
    scale_params: 394.480010986
    scale_params: 367.269989014
    scale_params: 490.190002441
    scale_params: 235.720001221
    scale_params: 1008.65002441
    scale_params: 733.979980469
    scale_params: 177.679992676
    scale_params: 446.869995117
  }
}
layer {
  name: "bn2a_branch2a"
  type: "BatchNorm"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2a_branch2a"
  type: "Scale"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2a_relu"
  type: "ReLU"
  bottom: "res2a_branch2a"
  top: "res2a_branch2a"
  relu_param {
  }
}
layer {
  name: "res2a_branch2b"
  type: "Convolution"
  bottom: "res2a_branch2a"
  top: "res2a_branch2b"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 27.2299995422
    scale_out: 28.0499992371
    scale_params: 678.309997559
    scale_params: 527.380004883
    scale_params: 1477.39001465
    scale_params: 598.25
    scale_params: 1042.11999512
    scale_params: 990.520019531
    scale_params: 2106.89990234
    scale_params: 588.08001709
    scale_params: 1084.06994629
    scale_params: 792.799987793
    scale_params: 381.299987793
    scale_params: 603.690002441
    scale_params: 768.179992676
    scale_params: 711.520019531
    scale_params: 450.630004883
    scale_params: 571.390014648
    scale_params: 410.739990234
    scale_params: 572.440002441
    scale_params: 1186.73999023
    scale_params: 643.450012207
    scale_params: 1206.86999512
    scale_params: 1163.82995605
    scale_params: 749.770019531
    scale_params: 743.700012207
    scale_params: 813.739990234
    scale_params: 1109.08996582
    scale_params: 572.690002441
    scale_params: 2533.12011719
    scale_params: 805.770019531
    scale_params: 1000.27001953
    scale_params: 626.659973145
    scale_params: 1607.11999512
    scale_params: 938.739990234
    scale_params: 901.760009766
    scale_params: 1399.58996582
    scale_params: 650.270019531
    scale_params: 525.75
    scale_params: 1337.17004395
    scale_params: 1438.90002441
    scale_params: 541.150024414
    scale_params: 15373719552.0
    scale_params: 1633.48999023
    scale_params: 713.659973145
    scale_params: 678.039978027
    scale_params: 354.25
    scale_params: 1135.38000488
    scale_params: 1124.67004395
    scale_params: 1543.45996094
    scale_params: 711.729980469
    scale_params: 453.570007324
    scale_params: 878.41998291
    scale_params: 356.329986572
    scale_params: 2004.23999023
    scale_params: 415.440002441
    scale_params: 569.849975586
    scale_params: 1034.45996094
    scale_params: 446.010009766
    scale_params: 1352.94995117
    scale_params: 803.359985352
    scale_params: 571.010009766
    scale_params: 348.350006104
    scale_params: 334.910003662
    scale_params: 374.910003662
    scale_params: 1049.41003418
  }
}
layer {
  name: "bn2a_branch2b"
  type: "BatchNorm"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2a_branch2b"
  type: "Scale"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a_branch2b_relu"
  type: "ReLU"
  bottom: "res2a_branch2b"
  top: "res2a_branch2b"
  relu_param {
  }
}
layer {
  name: "res2a_branch2c"
  type: "Convolution"
  bottom: "res2a_branch2b"
  top: "res2a_branch2c"
  convolution_param {
    num_output: 224
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 28.0499992371
    scale_out: 15.1199998856
    scale_params: 4827.56005859
    scale_params: 155.520004272
    scale_params: 1781.59997559
    scale_params: 1806003.25
    scale_params: 965.890014648
    scale_params: 311.279998779
    scale_params: 506.809997559
    scale_params: 732.940002441
    scale_params: 1714.10998535
    scale_params: 213.350006104
    scale_params: 433.540008545
    scale_params: 436.959991455
    scale_params: 746.570007324
    scale_params: 6626.64013672
    scale_params: 221.119995117
    scale_params: 378.359985352
    scale_params: 356.25
    scale_params: 9038.0703125
    scale_params: 1123.52001953
    scale_params: 276.660003662
    scale_params: 410.920013428
    scale_params: 4868.89013672
    scale_params: 393.480010986
    scale_params: 342.570007324
    scale_params: 4273446.5
    scale_params: 390.179992676
    scale_params: 32170.2792969
    scale_params: 265.0
    scale_params: 1426.66003418
    scale_params: 471.049987793
    scale_params: 478.630004883
    scale_params: 304633.4375
    scale_params: 1021.41998291
    scale_params: 70581008.0
    scale_params: 990.369995117
    scale_params: 262.959991455
    scale_params: 2445.0
    scale_params: 276.630004883
    scale_params: 3519.88989258
    scale_params: 215.690002441
    scale_params: 2999.89990234
    scale_params: 207.089996338
    scale_params: 84080.75
    scale_params: 340.019989014
    scale_params: 335.089996338
    scale_params: 866.400024414
    scale_params: 861.460021973
    scale_params: 1118.97998047
    scale_params: 460.390014648
    scale_params: 321.260009766
    scale_params: 414.929992676
    scale_params: 11499.6396484
    scale_params: 165.070007324
    scale_params: 370.760009766
    scale_params: 151.529998779
    scale_params: 2835.45996094
    scale_params: 447.940002441
    scale_params: 1440.01000977
    scale_params: 478.279998779
    scale_params: 197.119995117
    scale_params: 8162.56005859
    scale_params: 352.619995117
    scale_params: 1500.19995117
    scale_params: 350.869995117
    scale_params: 6737.02978516
    scale_params: 180.470001221
    scale_params: 1683.67004395
    scale_params: 454.660003662
    scale_params: 6569.66992188
    scale_params: 2240.56005859
    scale_params: 5972.70019531
    scale_params: 364.109985352
    scale_params: 336.260009766
    scale_params: 18474.6601562
    scale_params: 852.780029297
    scale_params: 9150.0
    scale_params: 712.08001709
    scale_params: 475.649993896
    scale_params: 5945.35986328
    scale_params: 966.460021973
    scale_params: 171.919998169
    scale_params: 1825.16003418
    scale_params: 892.690002441
    scale_params: 197.36000061
    scale_params: 215.36000061
    scale_params: 272.899993896
    scale_params: 346.049987793
    scale_params: 766.770019531
    scale_params: 446.700012207
    scale_params: 102.199996948
    scale_params: 355.779998779
    scale_params: 162.679992676
    scale_params: 399.660003662
    scale_params: 112.980003357
    scale_params: 351.0
    scale_params: 1032.06994629
    scale_params: 342.390014648
    scale_params: 350.029998779
    scale_params: 611.599975586
    scale_params: 175.669998169
    scale_params: 226.559997559
    scale_params: 3221.98999023
    scale_params: 1284.4699707
    scale_params: 858.849975586
    scale_params: 3227.70996094
    scale_params: 303.440002441
    scale_params: 441.369995117
    scale_params: 252.559997559
    scale_params: 437.5
    scale_params: 397.649993896
    scale_params: 1602.63000488
    scale_params: 1275.51000977
    scale_params: 688.75
    scale_params: 469.459991455
    scale_params: 313.049987793
    scale_params: 864.880004883
    scale_params: 361.420013428
    scale_params: 289.470001221
    scale_params: 642.530029297
    scale_params: 413.720001221
    scale_params: 5029.70019531
    scale_params: 684.619995117
    scale_params: 1260.63000488
    scale_params: 268523.21875
    scale_params: 708.510009766
    scale_params: 469.739990234
    scale_params: 501.339996338
    scale_params: 129.869995117
    scale_params: 237.649993896
    scale_params: 294.679992676
    scale_params: 312.059997559
    scale_params: 1453.01000977
    scale_params: 17849.0703125
    scale_params: 478.290008545
    scale_params: 425.470001221
    scale_params: 1621.90002441
    scale_params: 324.369995117
    scale_params: 182.789993286
    scale_params: 332.799987793
    scale_params: 2558.02001953
    scale_params: 3462.55004883
    scale_params: 487.230010986
    scale_params: 9142.94042969
    scale_params: 4671.33007812
    scale_params: 610.549987793
    scale_params: 522.119995117
    scale_params: 397.809997559
    scale_params: 298.230010986
    scale_params: 894.25
    scale_params: 161.880004883
    scale_params: 19998.6503906
    scale_params: 1059.91003418
    scale_params: 257.769989014
    scale_params: 537.650024414
    scale_params: 269.679992676
    scale_params: 673.590026855
    scale_params: 663.429992676
    scale_params: 285.769989014
    scale_params: 2614.5
    scale_params: 225.080001831
    scale_params: 293.670013428
    scale_params: 276.910003662
    scale_params: 154.059997559
    scale_params: 614.549987793
    scale_params: 746.590026855
    scale_params: 313.670013428
    scale_params: 2184870912.0
    scale_params: 614316992.0
    scale_params: 812.789978027
    scale_params: 16875.890625
    scale_params: 217.820007324
    scale_params: 469.399993896
    scale_params: 167.679992676
    scale_params: 218.210006714
    scale_params: 468.489990234
    scale_params: 15759.2900391
    scale_params: 9280.86035156
    scale_params: 207.449996948
    scale_params: 467.609985352
    scale_params: 819.239990234
    scale_params: 1612.02001953
    scale_params: 804.010009766
    scale_params: 141.419998169
    scale_params: 196.589996338
    scale_params: 407.75
    scale_params: 455.829986572
    scale_params: 2679.97998047
    scale_params: 10958.1298828
    scale_params: 186.130004883
    scale_params: 46241.6289062
    scale_params: 247.509994507
    scale_params: 855.030029297
    scale_params: 365.790008545
    scale_params: 159.759994507
    scale_params: 842.900024414
    scale_params: 1102.7800293
    scale_params: 321.820007324
    scale_params: 181.320007324
    scale_params: 141.449996948
    scale_params: 1922.59997559
    scale_params: 139.11000061
    scale_params: 652.590026855
    scale_params: 375.600006104
    scale_params: 391.029998779
    scale_params: 342.089996338
    scale_params: 230.770004272
    scale_params: 308.510009766
    scale_params: 301.910003662
    scale_params: 623.380004883
    scale_params: 699.989990234
    scale_params: 1049.54003906
    scale_params: 177.899993896
    scale_params: 283.769989014
    scale_params: 491.720001221
    scale_params: 16248.5097656
    scale_params: 4837.79980469
    scale_params: 304.339996338
    scale_params: 427.040008545
    scale_params: 475.559997559
    scale_params: 525.16998291
    scale_params: 949.159973145
    scale_params: 208.320007324
    scale_params: 242.039993286
    scale_params: 366.369995117
  }
}
layer {
  name: "bn2a_branch2c"
  type: "BatchNorm"
  bottom: "res2a_branch2c"
  top: "res2a_branch2c"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2a_branch2c"
  type: "Scale"
  bottom: "res2a_branch2c"
  top: "res2a_branch2c"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2a"
  type: "Eltwise"
  bottom: "res2a_branch1"
  bottom: "res2a_branch2c"
  top: "res2a"
  eltwise_param {
  }
}
layer {
  name: "res2a_relu"
  type: "ReLU"
  bottom: "res2a"
  top: "res2a"
  relu_param {
  }
}
layer {
  name: "res2b_branch2a"
  type: "Convolution"
  bottom: "res2a"
  top: "res2b_branch2a"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 15.1199998856
    scale_out: 23.0499992371
    scale_params: 666.489990234
    scale_params: 589.380004883
    scale_params: 4477590016.0
    scale_params: 738.380004883
    scale_params: 466.119995117
    scale_params: 856.900024414
    scale_params: 544.119995117
    scale_params: 820.630004883
    scale_params: 590.809997559
    scale_params: 549.289978027
    scale_params: 267.089996338
    scale_params: 812.359985352
    scale_params: 577.390014648
    scale_params: 832.729980469
    scale_params: 3749027584.0
    scale_params: 366.320007324
    scale_params: 649.200012207
    scale_params: 384.5
    scale_params: 897.140014648
    scale_params: 5204684800.0
    scale_params: 713.820007324
    scale_params: 1106.18994141
    scale_params: 11989309440.0
    scale_params: 581.780029297
    scale_params: 1158.07995605
    scale_params: 690.760009766
    scale_params: 493.790008545
    scale_params: 597.880004883
    scale_params: 985.159973145
    scale_params: 622.630004883
    scale_params: 1123.2800293
    scale_params: 999.190002441
    scale_params: 900.609985352
    scale_params: 646.979980469
    scale_params: 889.210021973
    scale_params: 473.549987793
    scale_params: 545.260009766
    scale_params: 684.83001709
    scale_params: 727.940002441
    scale_params: 670.710021973
    scale_params: 631.609985352
    scale_params: 374.459991455
    scale_params: 790.090026855
    scale_params: 946.16998291
    scale_params: 1016.54998779
    scale_params: 629.690002441
    scale_params: 6343547392.0
    scale_params: 487.390014648
    scale_params: 706.380004883
    scale_params: 894.700012207
    scale_params: 279.410003662
    scale_params: 1185.47998047
    scale_params: 687.780029297
    scale_params: 4334131712.0
    scale_params: 1121.65002441
    scale_params: 907.58001709
    scale_params: 560.559997559
    scale_params: 892.859985352
    scale_params: 1142.16003418
    scale_params: 7891884032.0
    scale_params: 453.989990234
    scale_params: 882.599975586
    scale_params: 658.869995117
    scale_params: 947.030029297
  }
}
layer {
  name: "bn2b_branch2a"
  type: "BatchNorm"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2b_branch2a"
  type: "Scale"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b_branch2a_relu"
  type: "ReLU"
  bottom: "res2b_branch2a"
  top: "res2b_branch2a"
  relu_param {
  }
}
layer {
  name: "res2b_branch2b"
  type: "Convolution"
  bottom: "res2b_branch2a"
  top: "res2b_branch2b"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 23.0499992371
    scale_out: 19.1000003815
    scale_params: 511.739990234
    scale_params: 249.190002441
    scale_params: 634.479980469
    scale_params: 301.369995117
    scale_params: 599.739990234
    scale_params: 835.83001709
    scale_params: 128.410003662
    scale_params: 355.540008545
    scale_params: 478.540008545
    scale_params: 1193.70996094
    scale_params: 870.469970703
    scale_params: 563.909973145
    scale_params: 685.119995117
    scale_params: 513.150024414
    scale_params: 296.649993896
    scale_params: 297.329986572
    scale_params: 544.640014648
    scale_params: 978.869995117
    scale_params: 728.41998291
    scale_params: 406.070007324
    scale_params: 1325.44995117
    scale_params: 794.090026855
    scale_params: 338.720001221
    scale_params: 451.859985352
    scale_params: 787.539978027
    scale_params: 853.41998291
    scale_params: 615.859985352
    scale_params: 618.130004883
    scale_params: 523.880004883
    scale_params: 739.090026855
    scale_params: 359.970001221
    scale_params: 432.709991455
    scale_params: 765.119995117
    scale_params: 821.159973145
    scale_params: 684.270019531
    scale_params: 609.479980469
    scale_params: 592.090026855
    scale_params: 705.400024414
    scale_params: 690.549987793
    scale_params: 973.190002441
    scale_params: 681.049987793
    scale_params: 574.450012207
    scale_params: 703.309997559
    scale_params: 737.659973145
    scale_params: 351.190002441
    scale_params: 1109.7800293
    scale_params: 655.75
    scale_params: 608.659973145
    scale_params: 690.179992676
    scale_params: 927.700012207
    scale_params: 622.280029297
    scale_params: 496.320007324
    scale_params: 698.409973145
    scale_params: 238.559997559
    scale_params: 441.200012207
    scale_params: 590.770019531
    scale_params: 248.509994507
    scale_params: 480.470001221
    scale_params: 317.079986572
    scale_params: 145.5
    scale_params: 682.309997559
    scale_params: 955.280029297
    scale_params: 969.539978027
    scale_params: 264.609985352
  }
}
layer {
  name: "bn2b_branch2b"
  type: "BatchNorm"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2b_branch2b"
  type: "Scale"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b_branch2b_relu"
  type: "ReLU"
  bottom: "res2b_branch2b"
  top: "res2b_branch2b"
  relu_param {
  }
}
layer {
  name: "res2b_branch2c"
  type: "Convolution"
  bottom: "res2b_branch2b"
  top: "res2b_branch2c"
  convolution_param {
    num_output: 224
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 19.1000003815
    scale_out: 15.1199998856
    scale_params: 331.220001221
    scale_params: 26265.3398438
    scale_params: 97582.1796875
    scale_params: 286.75
    scale_params: 208.759994507
    scale_params: 334.959991455
    scale_params: 254.429992676
    scale_params: 186.940002441
    scale_params: 4522156.5
    scale_params: 192.669998169
    scale_params: 356.959991455
    scale_params: 923.659973145
    scale_params: 156.720001221
    scale_params: 1769.47998047
    scale_params: 775.479980469
    scale_params: 445.130004883
    scale_params: 33538.2695312
    scale_params: 58913.0585938
    scale_params: 226.279998779
    scale_params: 209.100006104
    scale_params: 595.929992676
    scale_params: 95018.03125
    scale_params: 205.559997559
    scale_params: 325618.78125
    scale_params: 481.720001221
    scale_params: 35656.3710938
    scale_params: 496.269989014
    scale_params: 1261.36999512
    scale_params: 1087.40002441
    scale_params: 561.219970703
    scale_params: 222.130004883
    scale_params: 889.109985352
    scale_params: 181.229995728
    scale_params: 26163.0195312
    scale_params: 242.279998779
    scale_params: 1089.81005859
    scale_params: 632.840026855
    scale_params: 324.950012207
    scale_params: 171.339996338
    scale_params: 42945.0898438
    scale_params: 1173.45996094
    scale_params: 706.309997559
    scale_params: 213.990005493
    scale_params: 367.920013428
    scale_params: 210.940002441
    scale_params: 201.309997559
    scale_params: 233.880004883
    scale_params: 440104.71875
    scale_params: 22719.8105469
    scale_params: 86907.421875
    scale_params: 142.630004883
    scale_params: 4159.60009766
    scale_params: 1067.26000977
    scale_params: 290.600006104
    scale_params: 1920.7199707
    scale_params: 2060.36010742
    scale_params: 26338.3203125
    scale_params: 1022.03997803
    scale_params: 377.630004883
    scale_params: 37279.2382812
    scale_params: 54330.8710938
    scale_params: 199.320007324
    scale_params: 867.880004883
    scale_params: 451.200012207
    scale_params: 2866.7800293
    scale_params: 4132.06982422
    scale_params: 291.049987793
    scale_params: 432.929992676
    scale_params: 310090.59375
    scale_params: 584.340026855
    scale_params: 156.160003662
    scale_params: 134.919998169
    scale_params: 2681.37988281
    scale_params: 1062.48999023
    scale_params: 2737.70996094
    scale_params: 317.290008545
    scale_params: 653.719970703
    scale_params: 151.460006714
    scale_params: 15458.7802734
    scale_params: 9670.95019531
    scale_params: 2262.33007812
    scale_params: 356.350006104
    scale_params: 12877.1699219
    scale_params: 14831.6298828
    scale_params: 44195.5117188
    scale_params: 2178.76000977
    scale_params: 91700.96875
    scale_params: 56062.390625
    scale_params: 59953.5507812
    scale_params: 392.540008545
    scale_params: 1126.69995117
    scale_params: 231.979995728
    scale_params: 267.010009766
    scale_params: 1919.15002441
    scale_params: 11324.7695312
    scale_params: 71318.328125
    scale_params: 762.030029297
    scale_params: 1817.45996094
    scale_params: 1198.40002441
    scale_params: 610.179992676
    scale_params: 10038.0400391
    scale_params: 4173.0
    scale_params: 455745.46875
    scale_params: 1939.23999023
    scale_params: 72733.4765625
    scale_params: 850.219970703
    scale_params: 181.669998169
    scale_params: 2081.16992188
    scale_params: 169.759994507
    scale_params: 702.590026855
    scale_params: 29937.4902344
    scale_params: 989.890014648
    scale_params: 10034.5097656
    scale_params: 300.290008545
    scale_params: 2230.5300293
    scale_params: 37495.8398438
    scale_params: 142.550003052
    scale_params: 238.070007324
    scale_params: 100404.882812
    scale_params: 237.449996948
    scale_params: 310.140014648
    scale_params: 207.199996948
    scale_params: 273.839996338
    scale_params: 267164.40625
    scale_params: 32252.390625
    scale_params: 3229.5
    scale_params: 227.509994507
    scale_params: 333.269989014
    scale_params: 228.61000061
    scale_params: 29120.5292969
    scale_params: 220.220001221
    scale_params: 527.429992676
    scale_params: 145.820007324
    scale_params: 315.309997559
    scale_params: 308.690002441
    scale_params: 1583.70996094
    scale_params: 336.010009766
    scale_params: 202.949996948
    scale_params: 8224.29980469
    scale_params: 10110.1201172
    scale_params: 318379.84375
    scale_params: 410.859985352
    scale_params: 195.240005493
    scale_params: 618.640014648
    scale_params: 71697.0
    scale_params: 2420.79003906
    scale_params: 369.950012207
    scale_params: 11289.5
    scale_params: 3497.56005859
    scale_params: 776.270019531
    scale_params: 3923.69995117
    scale_params: 668.210021973
    scale_params: 393.459991455
    scale_params: 251.210006714
    scale_params: 221.270004272
    scale_params: 27747.1894531
    scale_params: 191.910003662
    scale_params: 703.440002441
    scale_params: 201800.796875
    scale_params: 1321.18994141
    scale_params: 3843.32006836
    scale_params: 1598.01000977
    scale_params: 10630.8701172
    scale_params: 51380.3007812
    scale_params: 322.230010986
    scale_params: 994.030029297
    scale_params: 306.859985352
    scale_params: 120828.820312
    scale_params: 54630.8515625
    scale_params: 328.850006104
    scale_params: 219.5
    scale_params: 8333.46972656
    scale_params: 1848.13000488
    scale_params: 4851497.0
    scale_params: 611.400024414
    scale_params: 2804.82006836
    scale_params: 249.220001221
    scale_params: 1310.40002441
    scale_params: 474.850006104
    scale_params: 196.089996338
    scale_params: 428.709991455
    scale_params: 611.909973145
    scale_params: 14093.6601562
    scale_params: 1195.83996582
    scale_params: 205.149993896
    scale_params: 268.670013428
    scale_params: 219.740005493
    scale_params: 22452.2207031
    scale_params: 665732.125
    scale_params: 127742.078125
    scale_params: 2256.64990234
    scale_params: 86676.53125
    scale_params: 1868.17004395
    scale_params: 164.990005493
    scale_params: 250.949996948
    scale_params: 9617.11035156
    scale_params: 8261.04003906
    scale_params: 843.859985352
    scale_params: 5574.91015625
    scale_params: 17996.75
    scale_params: 511.700012207
    scale_params: 56735.3984375
    scale_params: 491.399993896
    scale_params: 970.969970703
    scale_params: 1718.32995605
    scale_params: 220.929992676
    scale_params: 1390.33996582
    scale_params: 359.100006104
    scale_params: 10173.0898438
    scale_params: 586.590026855
    scale_params: 301.359985352
    scale_params: 530.590026855
    scale_params: 1024.5300293
    scale_params: 13396.7597656
    scale_params: 501.609985352
    scale_params: 406.269989014
    scale_params: 349.019989014
    scale_params: 647.039978027
    scale_params: 308.839996338
    scale_params: 30964.9003906
    scale_params: 8963.71972656
    scale_params: 354.380004883
    scale_params: 16228.5195312
    scale_params: 1219.64001465
  }
}
layer {
  name: "bn2b_branch2c"
  type: "BatchNorm"
  bottom: "res2b_branch2c"
  top: "res2b_branch2c"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2b_branch2c"
  type: "Scale"
  bottom: "res2b_branch2c"
  top: "res2b_branch2c"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2b"
  type: "Eltwise"
  bottom: "res2a"
  bottom: "res2b_branch2c"
  top: "res2b"
  eltwise_param {
  }
}
layer {
  name: "res2b_relu"
  type: "ReLU"
  bottom: "res2b"
  top: "res2b"
  relu_param {
  }
}
layer {
  name: "res2c_branch2a"
  type: "Convolution"
  bottom: "res2b"
  top: "res2c_branch2a"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 15.1199998856
    scale_out: 30.0200004578
    scale_params: 309.920013428
    scale_params: 276.369995117
    scale_params: 716.25
    scale_params: 893.5
    scale_params: 503.510009766
    scale_params: 583.309997559
    scale_params: 644.520019531
    scale_params: 885.0
    scale_params: 637.380004883
    scale_params: 764.140014648
    scale_params: 882.700012207
    scale_params: 276.299987793
    scale_params: 743.950012207
    scale_params: 703.719970703
    scale_params: 527.409973145
    scale_params: 507.489990234
    scale_params: 881.650024414
    scale_params: 526.929992676
    scale_params: 1010.17999268
    scale_params: 525.700012207
    scale_params: 4837870592.0
    scale_params: 499.160003662
    scale_params: 803.409973145
    scale_params: 658.099975586
    scale_params: 3691783936.0
    scale_params: 686.880004883
    scale_params: 926.190002441
    scale_params: 945.880004883
    scale_params: 996.630004883
    scale_params: 652.030029297
    scale_params: 694.130004883
    scale_params: 460.399993896
    scale_params: 273.709991455
    scale_params: 857.619995117
    scale_params: 992.58001709
    scale_params: 556.599975586
    scale_params: 657.260009766
    scale_params: 501.290008545
    scale_params: 602.409973145
    scale_params: 920.090026855
    scale_params: 252.919998169
    scale_params: 658.549987793
    scale_params: 518.729980469
    scale_params: 530.559997559
    scale_params: 647.780029297
    scale_params: 631.989990234
    scale_params: 799.400024414
    scale_params: 3938501632.0
    scale_params: 427.010009766
    scale_params: 634.760009766
    scale_params: 621.409973145
    scale_params: 523.869995117
    scale_params: 842.340026855
    scale_params: 478.730010986
    scale_params: 732.33001709
    scale_params: 632.030029297
    scale_params: 734.539978027
    scale_params: 609.039978027
    scale_params: 249.690002441
    scale_params: 736.010009766
    scale_params: 714.200012207
    scale_params: 815.489990234
    scale_params: 1034.51000977
    scale_params: 2162.65991211
  }
}
layer {
  name: "bn2c_branch2a"
  type: "BatchNorm"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2c_branch2a"
  type: "Scale"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2c_branch2a_relu"
  type: "ReLU"
  bottom: "res2c_branch2a"
  top: "res2c_branch2a"
  relu_param {
  }
}
layer {
  name: "res2c_branch2b"
  type: "Convolution"
  bottom: "res2c_branch2a"
  top: "res2c_branch2b"
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 30.0200004578
    scale_out: 24.2700004578
    scale_params: 582.630004883
    scale_params: 361.279998779
    scale_params: 345.940002441
    scale_params: 1059.27001953
    scale_params: 615.780029297
    scale_params: 320.390014648
    scale_params: 392.359985352
    scale_params: 481.549987793
    scale_params: 288.410003662
    scale_params: 853.340026855
    scale_params: 602.679992676
    scale_params: 459.980010986
    scale_params: 246.88999939
    scale_params: 555.91998291
    scale_params: 479.959991455
    scale_params: 939.150024414
    scale_params: 579.570007324
    scale_params: 672.58001709
    scale_params: 493.529998779
    scale_params: 435.320007324
    scale_params: 178.100006104
    scale_params: 513.710021973
    scale_params: 441.519989014
    scale_params: 535.75
    scale_params: 491.459991455
    scale_params: 622.020019531
    scale_params: 601.159973145
    scale_params: 557.700012207
    scale_params: 768.75
    scale_params: 622.679992676
    scale_params: 449.170013428
    scale_params: 677.25
    scale_params: 485.820007324
    scale_params: 505.420013428
    scale_params: 559.219970703
    scale_params: 552.33001709
    scale_params: 498.820007324
    scale_params: 853.890014648
    scale_params: 567.510009766
    scale_params: 688.590026855
    scale_params: 770.609985352
    scale_params: 466.5
    scale_params: 880.049987793
    scale_params: 611.400024414
    scale_params: 619.690002441
    scale_params: 711.320007324
    scale_params: 790.950012207
    scale_params: 477.690002441
    scale_params: 776.66998291
    scale_params: 682.530029297
    scale_params: 560.200012207
    scale_params: 465.279998779
    scale_params: 840.400024414
    scale_params: 563.840026855
    scale_params: 978.280029297
    scale_params: 476.079986572
    scale_params: 575.58001709
    scale_params: 516.809997559
    scale_params: 945.429992676
    scale_params: 664.5
    scale_params: 1219.56005859
    scale_params: 621.940002441
    scale_params: 273.839996338
    scale_params: 674.039978027
  }
}
layer {
  name: "bn2c_branch2b"
  type: "BatchNorm"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  param {
    lr_mult: 0.0
  }
  batch_norm_param {
    moving_average_fraction: 0.899999976158
    filler {
      value: 1.0
    }
  }
}
layer {
  name: "scale2c_branch2b"
  type: "Scale"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
  param {
    decay_mult: 0.0
  }
  param {
    decay_mult: 0.0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "res2c_branch2b_relu"
  type: "ReLU"
  bottom: "res2c_branch2b"
  top: "res2c_branch2b"
  relu_param {
  }
}
layer {
  name: "res2c_branch2c"
  type: "Convolution"
  bottom: "res2c_branch2b"
  top: "res2c_branch2c"
  convolution_param {
    num_output: 224
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
  quantization_param {
    bw_layer_in: 8
    bw_layer_out: 8
    bw_params: 8
    scale_in: 24.2700004578
    scale_out: 15.1199998856
    scale_params: 126.230003357
    scale_params: 52467.9296875
    scale_params: 62078.6484375
    scale_params: 156.710006714
    scale_params: 174.429992676
    scale_params: 7033.58007812
    scale_params: 216.13999939
    scale_params: 317.369995117
    scale_params: 44034.0390625
    scale_params: 311.829986572
    scale_params: 455.579986572
    scale_params: 1192.08996582
    scale_params: 298.790008545
    scale_params: 9267.96972656
    scale_params: 1542.19995117
    scale_params: 625.520019531
    scale_params: 23970.8496094
    scale_params: 148098.90625
    scale_params: 1692.0
    scale_params: 1846.76000977
    scale_params: 542.299987793
    scale_params: 67971.6796875
    scale_params: 239.809997559
    scale_params: 2209.60009766
    scale_params: 119.75
    scale_params: 420.980010986
    scale_params: 171.970001221
    scale_params: 368.799987793
    scale_params: 86.4599990845
    scale_params: 3513.18994141
    scale_params: 259.309997559
    scale_params: 194.850006104
    scale_params: 905.719970703
    scale_params: 140.460006714
    scale_params: 269.540008545
    scale_params: 188914.90625
    scale_params: 73.3799972534
    scale_params: 964.809997559
    scale_params: 3929.0300293
    scale_params: 9874.98046875
    scale_params: 4594.56005859
    scale_params: 64518.6210938
    scale_params: 384.089996338
    scale_params: 349.619995117
    scale_params: 271.869995117
    scale_params: 388.079986572
    scale_params: 339.239990234
    scale_params: 145963.984375
    scale_params: 226.809997559
    scale_params: 1478.9699707
    scale_params: 1034.02001953
    scale_params: 63938.3007812
    scale_params: 501.25
    scale_params: 233.509994507
    scale_params: 2189.79003906
    scale_params: 103.419998169
    scale_params: 767.91998291
    scale_params: 146.539993286
    scale_params: 178848.953125
    scale_params: 21183.4101562
    scale_params: 31376.4296875
    scale_params: 306.790008545
    scale_params: 134.270004272
    scale_params: 1082.67004395
    scale_params: 9757.61035156
    scale_params: 11840.4404297
    scale_params: 197.559997559
    scale_params: 1317.20996094
    scale_params: 65463.7382812
    scale_params: 172.759994507
    scale_params: 4832.29003906
    scale_params: 578.130004883
    scale_params: 1933.06994629
    scale_params: 117.010002136
    scale_params: 257.880004883
    scale_params: 107.900001526
    scale_params: 1156.2800293
    scale_params: 1205.45996094
    scale_params: 157.899993896
    scale_params: 26100.0
    scale_params: 5390.87011719
    scale_params: 111.86000061
    scale_params: 13446.3496094
    scale_params: 31757.6699219
    scale_params: 112108.523438
    scale_params: 4384.22021484
    scale_params: 1090.35998535
    scale_params: 28810.9707031
    scale_params: 34882.859375
    scale_params: 2001688.25
    scale_params: 956.450012207
    scale_params: 155.630004883
    scale_params: 695.780029297
    scale_params: 136569.5625
    scale_params: 272643.71875
    scale_params: 56767.421875
    scale_params: 1041.86999512
    scale_params: 835.400024414
    scale_params: 139182.59375
    scale_params: 8577.66992188
    scale_params: 2424.61010742
    scale_params: 2073.58007812
    scale_params: 87152.5703125
    scale_params: 37223.8789062
    scale_params: 29930.2402344
    scale_params: 926.280029297
    scale_params: 597.890014648
    scale_params: 492.529998779
    scale_params: 218.61000061
    scale_params: 2608.39990234
    scale_params: 86161.7421875
    scale_params: 129.229995728
    scale_params: 5967.25
    scale_params: 281.399993896
    scale_params: 430.220001221
    scale_params: 55241.9492188
    scale_params: 502.670013428
    scale_params: 321.339996338
    scale_params: 262968.53125
    scale_params: 1727.56994629
    scale_params: 1194.55004883
    scale_params: 74262.25
    scale_params: 229.529998779
    scale_params: 33877.3085938
    scale_params: 637.820007324
    scale_params: 75508.640625
    scale_params: 282.190002441
    scale_params: 700.049987793
    scale_params: 154.869995117
    scale_params: 28393.4492188
    scale_params: 1345.34997559
    scale_params: 93.9499969482
    scale_params: 1669.73999023
    scale_params: 364.459991455
    scale_params: 634.200012207
    scale_params: 213.669998169
    scale_params: 359.269989014
    scale_params: 1561.48999023
    scale_params: 502141.25
    scale_params: 4437.89013672
    scale_params: 117009.257812
    scale_params: 310.980010986
    scale_params: 269.700012207
    scale_params: 165.600006104
    scale_params: 464852.15625
    scale_params: 18508.7597656
    scale_params: 597.200012207
